# Predstavitev Uporabljenih Tabel

Predstavili bomo uporabljene, prečiščene tabele, hranjene v mapi `tidy_data`.

In [3]:
from pathlib import Path
import pandas as pd

load_path = Path.cwd() / 'tidy_data'
for file in load_path.iterdir():
    data = pd.read_csv(file)
    globals()[file.stem] = data

## Splošni Ključi
Skozi tabele se bodo pojavljali splošni ključi, ki identificirajo podatke v vrstici. Med te spada:
- `round_id` - hrani indeks igrane partije,
- `turn_id` - hrani indeks igranega kroga,
- `user_id` - hrani indeks igralca

Slovar imen krogov hranimo v naslednji tabeli.

In [9]:
turn_ids

  turn_name  turn_id
0   preflop        0
1      flop        1
2      turn        2
3     river        3

## Akcije
Akcije nam povejo kdo je kdaj kaj igral.

In [6]:
action_ids.sample(5)

  action_name  action_id
0        fold          0
1        call          1
2       raise          2
3       check          3
4         bet          4
5       allin          5

Tabela `action_ids` hrani slovar, kjer so ključi indeksi in vrednosti imena akcij.

In [7]:
actions.sample(5)

        action_id  amount  round_id  turn_id  action_order  user_id
225937          3    0.00     13749        3            13      739
225291          0    0.00     13540        0             4      734
181192          1    1.00      7329        0             7      384
296439          2    1.25     26595        0             5     1276
61227           0    0.00     32981        0             4        7

Naprej imamo v tabeli `actions` hranjene podatke o akcijah, ki so jih igralci izvedli tekom igre. Stolpcu, ki hrani indeks akcije je dodan še stolpec, ki hrani denar, ki je bil vpleten v to akcijo (na primer, če igralec viša nam pove vrednost). Ta podatka skupaj s ključi `user_id`, `round_id` ter `turn_id` enolično identificira vsako akcijo. Ker želimo še vrstni red izvedenih akcij znotraj vsake od rund, hranimo še stolpec `action_orderr`.

## Zakupi v Igro
Hranimo podatke o tem kdo je zakupil v vsako partijo in s kolikšno količino denarja.

In [10]:
buyins.sample(5)

        buyin  round_id  user_id
52573   22.77       303       13
151339  52.51     27701      555
208169  25.00     21143     1188
42527   80.00     38727        5
32103   21.03     28303        5

## Dobljene Karte
Hranimo podatke o tem katere karte je dobil igralec na začetku vsake partije. Ta podatek je znan le za enega igralca.

In [8]:
received_cards

       round_id  user_id card1 card2
9432       9433        5    7♣    7♥
7682       7683        5   10♥    8♣
34646     34647        5    K♥    Q♠
4291       4292        5    2♣    J♠
14917     14918        5    2♥    6♠

## Plačani Blind-i
Hranimo tudi to kdo je katero partijo plačal veliki / mali blind.

In [11]:
blinds.sample(5)

       user_id  blind_type_id  round_id  value
52373      549              1      9910   0.50
21045       25              0     10823   0.25
38373      204              1     32395   0.50
18195        7              1     34566   1.00
13739        5              1     33358   0.50

Tu je `blind_type_id` enak 0, če je blind mali in 1, če je veliki. `value` predstavlja vrednost danega blind-a.

## Mizne Karte
Imamo informacije o tem katere karte so bile prikazane na mizi in kateri krog.

In [12]:
board.sample(5)

                board  round_id  turn_id
21823     9♦ 8♦ 9♠ Q♣     23021        2
30757     2♥ 2♠ A♠ 4♥     33052        2
10051  5♠ J♥ Q♥ 6♣ 7♥     10330        3
39511        J♦ 4♠ 9♦     42686        1
15173        2♣ 4♣ 9♥     15571        1

## Denar v Igri
To so informacije o tem koliko denarja je bilo vloženega v partijo.

In [17]:
potsize.sample(5)

       pot_size  round_id
16957     35.15     16958
31237     20.43     31238
541        5.10       542
14877      2.00     14878
6653       3.00      6654

## Prikaz Kart
Na koncu hranimo še informacije o relativnih dobičkih igralcev na koncu igrane partije

In [22]:
cardshow[cardshow.winnings != 0].sample(5)

        round_id  winnings  user_id
137958      6662     -6.60      420
74860       1187     -1.00       85
61541      29533      6.78       39
78462       6539     -0.25      119
112563     11969      1.63      239

Relativni dobički so predstavljeni v stolpcu `winnings`.